app/views/users/show.html.erb

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1  [["user_id", 7]]
---
<h2> Past Orders </h2>
<%= render @user.orders %>