app/views/orders/new.html.erb

SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 6], ["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = $1  [["cart_id", 1]]
---
  </tr>
  <% current_user.cart.cart_items.each do |cart_item| %>