app/views/orders/show.html.erb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 3]]
---
  </tr>
  <% @order.order_items.each do |order_item| %>