app/controllers/cart_items_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 7], ["LIMIT", 1]]
SELECT  1 AS one FROM "products" INNER JOIN "cart_items" ON "products"."id" = "cart_items"."product_id" WHERE "cart_items"."cart_id" = $1 AND "products"."id" = $2 LIMIT $3  [["cart_id", 2], ["id", 1], ["LIMIT", 1]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = $1 AND "cart_items"."product_id" = 1 LIMIT $2  [["cart_id", 2], ["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = $1  [["cart_id", 2]]
INSERT INTO "cart_items" ("quantity", "cart_id", "product_id", "price", "tax_rate", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["quantity", 1], ["cart_id", 1], ["product_id", 1], ["price", 5.0], ["tax_rate", "20.0"], ["created_at", "2017-09-12 15:02:11.837887"], ["updated_at", "2017-09-12 15:02:11.837887"]]
UPDATE "cart_items" SET "quantity" = $1, "updated_at" = $2 WHERE "cart_items"."id" = $3  [["quantity", 2], ["updated_at", "2017-09-12 11:09:01.145606"], ["id", 2]]
---
  def create

    chosen_product = Product.find(params[:product_id]) rescue nil
    # If cart already has this product then find the relevant cart_item and iterate quantity otherwise create a new cart_item for this product
    if current_user.cart.products.include?(chosen_product)
      # Find the cart_item with the chosen_product
      @cart_item = current_user.cart.cart_items.find_by(product_id: chosen_product)
      # Iterate the cart_item's quantity by one
      @cart_item.quantity = 1 if @cart_item.quantity.blank?
      @cart_item.quantity += 1 unless @cart_item.quantity.blank?
    else
      details = {cart_id: current_user.cart.id, product_id: chosen_product.id, price: chosen_product.price,
                 tax_rate: chosen_product.tax_rate, quantity: 1}
      @cart_item = CartItem.new(details)
    end
    # Save and redirect to cart show path
    @cart_item.save

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = $1  [["id", 2]]
---
  def destroy
    @cart_item = CartItem.find(params[:id]) rescue nil
    @cart_item.destroy

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "cart_items" SET "quantity" = $1, "updated_at" = $2 WHERE "cart_items"."id" = $3  [["quantity", 3], ["updated_at", "2017-09-12 11:10:28.725902"], ["id", 2]]
---
  def add_quantity
    @cart_item = CartItem.find(params[:id]) rescue nil
    @cart_item.quantity = 1 if @cart_item.quantity.blank?
    @cart_item.quantity += 1 unless @cart_item.quantity.blank?
    @cart_item.save

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = $1  [["id", 4]]
UPDATE "cart_items" SET "quantity" = $1, "updated_at" = $2 WHERE "cart_items"."id" = $3  [["quantity", 3], ["updated_at", "2017-09-12 11:10:31.683990"], ["id", 2]]
---
  def reduce_quantity
    @cart_item = CartItem.find(params[:id]) rescue nil
    if @cart_item.quantity > 1
      @cart_item.quantity -= 1
    else
      @cart_item.destroy
    end
    @cart_item.save