app/controllers/carts_controller.rb

  def find_product
    @product = Product.find(params[:product_id]) rescue nil
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]