app/controllers/orders_controller.rb

  def create
    @order = Order.new(order_params)
    @order.user = current_user
    @order.save
    @current_user.cart.cart_items.each do |item|
      details = {order_id: @order.id, product_id: item.product_id, price: item.product.price,
                 tax_rate: item.product.tax_rate, quantity: item.quantity}
      order_item = OrderItem.new(details)
      order_item.save
      item.destroy
---
INSERT INTO "orders" ("status", "transaction_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["status", "paid"], ["transaction_id", "ashdgsakhdfla"], ["user_id", 7], ["created_at", "2017-09-12 13:03:01.868756"], ["updated_at", "2017-09-12 13:03:01.868756"]]
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 7], ["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = $1  [["cart_id", 2]]
INSERT INTO "order_items" ("price", "quantity", "tax_rate", "order_id", "product_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["price", 5.0], ["quantity", 3], ["tax_rate", 20.0], ["order_id", 1], ["product_id", 1], ["created_at", "2017-09-12 15:02:51.287471"], ["updated_at", "2017-09-12 15:02:51.287471"]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = $1  [["id", 12]]

  def update
    @order.update_attributes(order_params)
---
UPDATE "orders" SET "status" = $1, "shipped_on" = $2, "delivered_on" = $3, "updated_at" = $4 WHERE "orders"."id" = $5  [["status", "delivered"], ["shipped_on", "2015-02-12"], ["delivered_on", "2015-02-20"], ["updated_at", "2017-09-13 09:01:31.765567"], ["id", 2]]

  def process_payment
    @order.update_attributes(order_params)
---
UPDATE "orders" SET "status" = $1, "transaction_id" = $2, "card" = $3, "cvv" = $4, "payment_mode" = $5, "updated_at" = $6 WHERE "orders"."id" = $7  [["status", "paid"], ["transaction_id", "7277a84e5dac9167dbe6"], ["card", "dzsxshbfcg"], ["cvv", "123"], ["payment_mode", "credit card"], ["updated_at", "2017-09-13 06:53:53.601906"], ["id", 14]]

  def load_order
    @order = Order.find(params[:id]) rescue nil
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]