app/controllers/products_controller.rb

INSERT INTO "products" ("name", "description", "price", "stock", "country", "state", "zip_code", "tax_rate", "cod", "shipping_charge_rate", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
  def create

    @product = Product.new(product_params)
    if @product.save

UPDATE "products" SET "name" = $1, "description" = $2, "price" = $3, "country" = $4, "state" = $5, "tax_rate" = $6, "cod" = $7, "zip_code" = $8, "stock" = $9, "updated_at" = $10 WHERE "products"."id" = $11
---
  def update

    if @product.update_attributes(product_params)

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def load_product
    @product = Product.find(params[:id]) rescue nil