app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
    	log_in @user
      @user.create_cart
---
INSERT INTO "users" ("name", "email", "password_digest", "contact", "country", "state", "address", "dob", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
INSERT INTO "carts" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 6], ["created_at", "2017-09-12 08:05:22.907571"], ["updated_at", "2017-09-12 08:05:22.907571"]]

  def update
    if @user.update_attributes(user_params)
---
UPDATE "users" SET "password_digest" = $1, "dob" = $2, "address" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["password_digest", "$2a$10$o5yD8q7/Gx1IG8lglMQp7OMwegXE87yGbDt6VJ/3lNgU6eEUJRTRq"], ["dob", "1995-05-23"], ["address", "xyz"], ["updated_at", "2017-09-11 06:04:38.338504"], ["id", 2]]

  def load_user
    @user = current_user unless current_user.admin?
    @user = User.find(params[:id]) if current_user.admin? rescue nil
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]